jorgebucaran/fisher
lilyball/nix-env.fish

IlanCosman/tide@v5

franciscolourenco/done
gazorby/fish-abbreviation-tips
jorgebucaran/nvm.fish
jethrokuan/z
PatrickF1/fzf.fish
